###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID linux01)
#  Generated on:      Thu May 23 05:59:40 2019
#  Design:            CHIP
#  Command:           saveDesign DBS/CHIP.inn
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 14.000000 -waveform {0.000000 7.000000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.05  [get_ports {OUT_VALID}]
set_load -pin_load -min  0.05  [get_ports {OUT_VALID}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[18]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[18]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[17]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[17]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[16]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[16]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[15]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[15]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[14]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[14]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[13]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[13]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[12]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[12]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[11]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[11]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[10]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[10]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[9]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[9]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[8]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[8]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[7]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[7]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[6]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[6]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[5]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[5]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[4]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[4]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[3]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[3]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[2]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[2]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[1]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[1]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_R[0]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_R[0]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[18]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[18]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[17]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[17]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[16]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[16]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[15]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[15]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[14]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[14]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[13]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[13]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[12]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[12]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[11]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[11]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[10]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[10]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[9]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[9]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[8]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[8]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[7]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[7]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[6]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[6]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[5]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[5]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[4]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[4]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[3]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[3]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[2]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[2]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[1]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[1]}]
set_load -pin_load -max  0.05  [get_ports {FFT2D_OUT_I[0]}]
set_load -pin_load -min  0.05  [get_ports {FFT2D_OUT_I[0]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[11]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[3]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {IN_VALID}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[0]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[16]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[9]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[16]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[12]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[8]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[5]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[4]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[1]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[12]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[0]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[17]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[17]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[13]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[9]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[6]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[13]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {MODE}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[5]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[2]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[1]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[18]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[18]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[14]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[7]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[6]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[3]}]
set_input_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[14]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[10]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[2]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[10]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[8]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[15]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[15]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[11]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_I[7]}]
set_input_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_IN_R[4]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[1]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[18]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[14]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[7]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[14]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[10]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[6]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[3]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[10]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[2]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[15]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[15]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[11]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[8]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[11]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[7]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[4]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[3]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[0]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[16]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[9]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[16]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[12]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[8]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[5]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[12]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[4]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[1]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[17]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[0]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[17]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[13]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[13]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[9]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[6]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {OUT_VALID}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[5]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_R[2]}]
set_output_delay -add_delay 7 -clock [get_clocks {clk}] [get_ports {FFT2D_OUT_I[18]}]
