###################################################################

# Created by write_sdc on Wed Jan 16 19:10:13 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_load -pin_load 0.05 [get_ports OUT_VALID]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[18]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[17]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[16]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[15]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[14]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[13]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[12]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[11]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[10]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[9]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[8]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[7]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[6]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[5]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[4]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[3]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[2]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[1]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_R[0]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[18]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[17]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[16]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[15]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[14]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[13]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[12]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[11]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[10]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[9]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[8]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[7]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[6]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[5]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[4]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[3]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[2]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[1]}]
set_load -pin_load 0.05 [get_ports {FFT2D_OUT_I[0]}]
create_clock [get_ports clk]  -period 14  -waveform {0 7}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  7  [get_ports IN_VALID]
set_input_delay -clock clk  7  [get_ports MODE]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[18]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[17]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[16]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[15]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[14]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[13]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[12]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[11]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[10]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[9]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[8]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[7]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[6]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[5]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[4]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[3]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[2]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[1]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_R[0]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[18]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[17]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[16]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[15]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[14]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[13]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[12]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[11]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[10]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[9]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[8]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[7]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[6]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[5]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[4]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[3]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[2]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[1]}]
set_input_delay -clock clk  7  [get_ports {FFT2D_IN_I[0]}]
set_output_delay -clock clk  7  [get_ports OUT_VALID]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[18]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[17]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[16]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[15]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[14]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[13]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[12]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[11]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[10]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[9]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[8]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[7]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[6]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[5]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[4]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[3]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[2]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[1]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_R[0]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[18]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[17]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[16]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[15]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[14]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[13]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[12]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[11]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[10]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[9]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[8]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[7]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[6]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[5]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[4]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[3]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[2]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[1]}]
set_output_delay -clock clk  7  [get_ports {FFT2D_OUT_I[0]}]
