###############################################################
#  Generated by:      Cadence Innovus 20.15-s105_1
#  OS:                Linux x86_64(Host ID ee29)
#  Generated on:      Fri May 26 20:41:30 2023
#  Design:            CHIP
#  Command:           routeDesign -globalDetail
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.05  [get_ports {out_valid}]
set_load -pin_load -min  0.05  [get_ports {out_valid}]
set_load -pin_load -max  0.05  [get_ports {out[3]}]
set_load -pin_load -min  0.05  [get_ports {out[3]}]
set_load -pin_load -max  0.05  [get_ports {out[2]}]
set_load -pin_load -min  0.05  [get_ports {out[2]}]
set_load -pin_load -max  0.05  [get_ports {out[1]}]
set_load -pin_load -min  0.05  [get_ports {out[1]}]
set_load -pin_load -max  0.05  [get_ports {out[0]}]
set_load -pin_load -min  0.05  [get_ports {out[0]}]
set_wire_load_mode top
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {in_valid}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {in_num[2]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {in_num[0]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {row[2]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {col[3]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {row[0]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {col[1]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {in_num[1]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {in_valid_num}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {row[3]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {row[1]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {col[2]}]
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {col[0]}]
set_output_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {out[2]}]
set_output_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {out[0]}]
set_output_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {out[3]}]
set_output_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {out_valid}]
set_output_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {out[1]}]
